print("РЕАЛИЗАЦИЯ ЧЕРЕЗ СПИСОК")
list_of_month = ['', 'зима', 'зима', 'весна', 'весна', 'весна', 'лето', 'лето', 'лето',
                 'осень', 'осень', 'осень', 'зима']
print(list_of_month[int(input("Введите номер месяца: "))].title())

print("РЕАЛИЗАЦИЯ ЧЕРЕЗ СЛОВАРЬ")
dict_of_month={1: "зима", 2: "зима", 3: "весна", 4: "весна", 5: "весна", 6: "лето", 7: "лето", 8: "лето",
               9: "осень", 10: "осень", 11: "осень", 12: "зима"}
print(dict_of_month[int(input("Введите номер месяца: "))].title())